Revit 2026 API

# RebarShapeVertex Class

---

A bend between segments of a rebar shape definition.

SystemObject Autodesk.Revit.DB.StructureRebarShapeVertex

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarShapeVertex : IDisposable
```
```vb
Public Class RebarShapeVertex
	Implements IDisposable
```
```cpp
public ref class RebarShapeVertex : IDisposable
```
```fsharp
type RebarShapeVertex =
    class
        interface IDisposable
    end
```

The RebarShapeVertex type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BendAngle | The range of permissible angles at this bend. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Turn | The sense of the turn. The Turn property must be set to Left or Right on each internal vertex before the RebarShapeDefinitionBySegments is used. Default is permissible for the first and last vertex, since they do not correspond to bends. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarShapeVertex |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetConstraints | Retrieve the list of constraints associated with this vertex. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetConstraints |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A RebarShapeVertex is part of a RebarShapeDefinitionBySegments object. There is one vertex between each pair of adjacent segments, plus one at each end of the overall shape. The end vertices currently are ignored by the shape definition, even if they have constraints.

A bend may have the default radius of the bar type referenced by the Rebar element, or it may have a radius defined by a parameter.

#### Reference

Autodesk.Revit.DB.Structure Namespace